## Последовательность решения задачи

**Ссылка:** [Codewars Kata Review](https://www.codewars.com/kata/reviews/55c4624d0538cef0df00009c/groups/67f0117840ea881d1b1413b3)

---

### 1. Полностью понять, что требуется сделать в задаче

**Ответ:** Нам дана строка, в которой есть подстоки с числами. Наша задача — реализовать функцию, которая ставит
слово на свое место, в зависимости от его цифры.

*   Пример: "is2 Thi1s T4est 3a"  -->  "Thi1s is2 3a T4est"
*   Пример: "4of Fo1r pe6ople g3ood th5e the2"  -->  "Fo1r the2 g3ood 4of th5e pe6ople"
*   Пример: ""  -->  ""
---

### 2. Разбить задачу на подзадачи

**Ответ:**
1. Если строка пустая, то вернуть пустую строку
2. Иначе определить, какая цифра находится в подстроке
3. Переставить слова в строке
4. Вернуть строку

---

### 3. Написать псевдокод (функции, осн. переменные, прим. последовательность действий)

**Ответ:**

```cpp

Функция order(sentence):
    Если sentence пустая:
        Вернуть пустую строку

    Разбить sentence на список слов
    Инициализировать пустой список для отсортированных слов

    Для каждого слова в списке слов:
        Найди все цифры в слове
        Объедини цифры в одну строку
        Преобразуй строку в целое число

        Добавь слово в список отсортированных слов на позицию, соответствующую целому числу

    Объедини отсортированные слова в строку
    Вернуть отсортированную строку

```
---

### 4. Реализовать функции

*   4.1. **Что должна делать функция?**
*   4.2. **Какие данные требуются?**
*   4.3. **Какие варианты входных данных могут быть?**
*   4.4. **Реализация тела функции.**
*   4.5. **Проверка и тестирование функции.**

**Ответ:**

**Б) Функция 'order':**

*   4.1. Что должна делать функция?
Функция должна принимать строку с словами, в которых могут быть цифры, и возвращать строку с этими словами, отсортированными по цифрам внутри них.

*   4.2. Какие данные требуются?
Строка, содержащая слова с цифрами.

*   4.3. Какие варианты входных данных могут быть?
Пустая строка. Строка с одним словом, содержащим цифру. Строка с несколькими словами, содержащими цифры. Строка без слов, содержащих цифры.

*   4.4. См. 5 пункт
*   4.5. См. 6 пункт

**Б) Функция 'calc_number':**

*   4.1. Что должна делать функция?
Функция должна принимать слово и возвращать список цифр, найденных в этом слове.

*   4.2. Какие данные требуются?
Входные данные: слово, в котором могут быть цифры.

*   4.3. Какие варианты входных данных могут быть?
Слово без цифр. Слово с одной цифрой. Слово с несколькими цифрами.

*   4.4.  def calc_number(word):
    return [i for i in word if i.isdigit()]

*   4.5. print(calc_number("T4est"))  # --> ['4']
	 print(calc_number("Hello"))  # --> []
	 print(calc_number("123"))  # --> ['1', '2', '3']

---

### 5. Написание кода основной функции

**Ответ:** 
    
def order(sentence):
    if len(sentence) == 0:
        return ""

    words = sentence.split()
    sorted_words = sorted(words, key=lambda word: int(''.join(calc_number(word))))
    
    return ' '.join(sorted_words)
---

### 6. Тестирование всей функции 

**Ответ:** 

Протестированно на

        order("is2 Thi1s T4est 3a"), "Thi1s is2 3a T4est")
        order("4of Fo1r pe6ople g3ood th5e the2"), "Fo1r the2 g3ood 4of th5e pe6ople")
        order(""), "")

---